In [51]:
import pandas as pd
import numpy as np

obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [52]:
obj2 = pd.Series([4, 7, -5, 3], index = ['d','b','a','c'])
obj2
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [53]:
obj2['a']
obj2['d'] = 6
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [54]:
obj2[obj2 > 0]
obj2*2
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [55]:
'b' in obj2
'e' in obj2

False

In [56]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000} #利用字典生成Series
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [57]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index = states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [58]:
pd.isnull(obj4)
pd.notnull(obj4)
obj4.isnull()
obj4.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [59]:
obj3 + obj4 #自动对齐

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [60]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [61]:
obj
obj.index = ['Bob','Steve','Jeff','Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [62]:
obj.values
obj.index

Index(['Bob', 'Steve', 'Jeff', 'Ryan'], dtype='object')

In [63]:
import pandas as pd

data = {'state': ['ohio','Nevada','ohio'],
       'year': [2000,2001,2002,],
       'pop':[1.5, 1.7, 3.6]}
frame = pd.DataFrame(data)

pd.DataFrame(data,columns = ['year','state','pop'])

frame2 = pd.DataFrame(data,columns = ['year','state', 'pop', 'debt'],
                     index = ['one','two','three'])
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [64]:
import numpy as np

frame2.state
frame2['year']

frame2.loc['one']
frame2['debt'] = 16.5
frame2['debt'] = np.arange(3.)
frame2

       year   state  pop  debt
one    2000    ohio  1.5   0.0
two    2001  Nevada  1.7   1.0
three  2002    ohio  3.6   2.0

In [65]:
val = pd.Series([-1.2, -1.5, -1.7], index = ['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    ohio  1.5   NaN
two    2001  Nevada  1.7  -1.2
three  2002    ohio  3.6   NaN

In [66]:
frame2['eastern'] = frame2.state =='Oh io' #判断条件是state的列是否为Oh io,并且生成了新的列，而frame2.eastern无法生成新的列
frame2
del frame2['eastern']
frame2

       year   state  pop  debt
one    2000    ohio  1.5   NaN
two    2001  Nevada  1.7  -1.2
three  2002    ohio  3.6   NaN

In [67]:
pop = {'Nevada': {2001:2.4, 2002: 2.9}, 'Ohio': {2000:1.5,2001:1.7, 2002:3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [68]:
frame3.T #进行转置
pd.DataFrame(pop, index = [2001, 2002,2003]) #index 可以是数字类型如int float

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [69]:
pdata = {'Ohio': frame3['Ohio'][:-1], 'Nevada':frame3['Nevada'][:2]} # -1代表删掉最后一个
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [70]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [71]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [72]:
# 索引对象
obj = pd.Series(range(3), index = ['a','b','c'])
index = obj.index
index
index[1:] 
#索引的对象无法改变
obj

a    0
b    1
c    2
dtype: int64

In [73]:
labels = pd.Index(np.arange(3))
labels
obj2 = pd.Series([1.5, -2.5, 0], index = labels)
obj2
obj2.index is labels

True

In [74]:
frame3
frame3.columns
'Ohio' in frame3.columns
2003 in frame3.index

False

In [75]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [76]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index = ['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [77]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e']) #只是重新排序，并不会重新更改映射关系
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [78]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index = [0, 2, 4])
obj3
obj3.reindex(range(9), method = 'ffill') #会自动填充根据之前的index来产生数据填充比如0，2 都是blue， reindex后产生的0，1，2就都是blue

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
6    yellow
7    yellow
8    yellow
dtype: object

In [79]:
frame = pd.DataFrame(np.arange(9).reshape(3, 3),index = ['a','c','d'],columns = ['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [80]:
frame2 = frame.reindex(['a','b','c','d']) #改行
frame2

states = ['Texas', 'Utah', 'California']
frame3 = frame.reindex(columns = states)
frame3

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [81]:
frame4 = frame.loc[['a', 'e', 'c', 'd'], states] # 先行， 后列
frame4

   Texas  Utah  California
a    1.0   NaN         2.0
e    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [82]:
obj = pd.Series(np.arange(5.), index = ['a', 'b', 'c', 'd', 'e']) # arange(5.)里面的数据类型是float
obj
new_obj = obj.drop('c')
new_obj
obj.drop(['d','c']) #删除多行就用列表

a    0.0
b    1.0
e    4.0
dtype: float64

In [83]:
data = pd.DataFrame(np.arange(16).reshape(4,4), index = ['Ohio', 'Colorado', 'Utah', 'New York'], columns = ['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [84]:
data.drop(['Colorado','Ohio']) #删除某行
data.drop('two', axis = 1)
data.drop(['two','four'], axis = 'columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [85]:
obj.drop('c', inplace = True) # inplace代表会清除背删除的数据
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [86]:
obj = pd.Series(np.arange(4.), index = ['a','b','c','d'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [87]:
obj['b']
obj[1]
obj[2:4]
obj['c':'d']
obj[['b','a','d']]
obj[[1,3]]
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [88]:
obj['b':'c']
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [89]:
data = pd.DataFrame(np.arange(16).reshape(4,4), index = ['Ohio','colorado','Utah','New York'], columns = ['one', 'two','three','four'])

In [90]:
data

          one  two  three  four
Ohio        0    1      2     3
colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [91]:
data['two']

Ohio         1
colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [92]:
data[['two', 'three']]

          two  three
Ohio        1      2
colorado    5      6
Utah        9     10
New York   13     14

In [93]:
data[:2] #前两行
data[data['three']>5]

          one  two  three  four
colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [94]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [95]:
data[data<5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [96]:
data.loc['colorado',['two', 'three']] #直接取行列的名字

two      5
three    6
Name: colorado, dtype: int32

In [97]:
data.iloc[2,[3, 0, 1]] #index 为2的行，和index为3，0，1的列

four    11
one      8
two      9
Name: Utah, dtype: int32

In [98]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
colorado     7    0    5
Utah        11    8    9

In [99]:
data.loc[:'Utah','two']
data.iloc[:,:2]

          one  two
Ohio        0    0
colorado    0    5
Utah        8    9
New York   12   13

In [100]:
ser = pd.Series(np.arange(3.))
ser
ser[-1]

KeyError: -1

In [101]:
ser2 = pd.Series(np.arange(3.), index = ['a', 'b', 'c'])
print(ser2)
ser2[-1] #最后一个

a    0.0
b    1.0
c    2.0
dtype: float64

2.0

In [102]:
print(ser[:1])

print(ser.loc[:1]) # 用于标签
ser.iloc[:1]#用于整数

0    0.0
dtype: float64
0    0.0
1    1.0
dtype: float64

0    0.0
dtype: float64

In [103]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index = ['a', 'c', 'd','e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],index = ['a', 'c','e','f','g'])
print(s1)
print(s2)
s1+s2

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64
a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [104]:
df1 = pd.DataFrame(np.arange(9.).reshape(3,3), columns = list('bcd'), index = ['Ohio','Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape(4,3), columns = list('bde'),index = ['Utah','Ohio','Texas','Oregon'])
df1
print(df1+df2)

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [105]:
df1 = pd.DataFrame(np.arange(12.).reshape(3,4),columns = list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape(4,5),columns = list('abcde'))
print(df1)
print(df2)
df2.loc[1,'b'] =np.nan
df2
df1+df2

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0
      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [106]:
df1.add(df2, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [107]:
1/df1
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [108]:
df1.reindex(columns = df2.columns, fill_value = 0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [109]:
arr = np.arange(12.).reshape((3,4))
arr
arr[0] #第1行
arr - arr[0] #在每一行都进行了操作，广播机制

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [110]:
frame = pd.DataFrame(np.arange(12.).reshape(4,3),columns =list('bde'),index = ['Utah','Ohio','Texas','Oregon'])
series = frame.iloc[0]
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [111]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [112]:
series2 = pd.Series(range(3), index = ['b','e','f'])
print(series2)
frame + series2

b    0
e    1
f    2
dtype: int64

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [113]:
series3 = frame['d']
frame
series3
frame.sub(series3, axis ='index') #在列上进行广播用sub，在行上匹配、

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [114]:
frame = pd.DataFrame(np.random.randn(4,3), columns = list('bde'), index = ['Utah','Ohio','Texas','Oregon'])
print(frame)
np.abs(frame)
frame

               b         d         e
Utah   -0.583892 -0.146152  0.778179
Ohio   -1.450007 -0.000473  0.876542
Texas  -1.689518  1.127254 -0.230713
Oregon -0.229660  0.796721 -0.702449

               b         d         e
Utah   -0.583892 -0.146152  0.778179
Ohio   -1.450007 -0.000473  0.876542
Texas  -1.689518  1.127254 -0.230713
Oregon -0.229660  0.796721 -0.702449

In [115]:
f = lambda x:x.max()-x.min()
print(frame.apply(f))
frame.apply(f, axis = 'columns')

b    1.459858
d    1.273405
e    1.578991
dtype: float64

Utah      1.362071
Ohio      2.326549
Texas     2.816772
Oregon    1.499170
dtype: float64

In [116]:
def f(x):
    return pd.Series([x.min(), x.max()],index = ['min','max'])
frame.apply(f)

            b         d         e
min -1.689518 -0.146152 -0.702449
max -0.229660  1.127254  0.876542

In [117]:
format = lambda x: '%.2f' % x
frame.applymap(format)
frame['e'].map(format)

Utah       0.78
Ohio       0.88
Texas     -0.23
Oregon    -0.70
Name: e, dtype: object

In [118]:
obj = pd.Series(range(4), index = ['d','a','b','c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [119]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)), index = ['three','one'],columns = ['d','a','b','c'])
frame
frame.sort_index()#本题根据字母顺序来排序
frame.sort_index(axis = 1)#对列名进行sort排序

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [120]:
frame.sort_index(axis = 1, ascending = False)#下降

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [121]:
obj = pd.Series([4,7,-3,2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [122]:
obj = pd.Series([4,np.nan,7,np.nan,-3,2])
obj.sort_values() #Nan总是在最后

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [123]:
frame = pd.DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})
frame
frame.sort_values(by = 'b', ascending = False) #根据b列进行从小到大排序

   b  a
1  7  1
0  4  0
3  2  1
2 -3  0

In [124]:
frame.sort_values(by = ['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [125]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank() #返回的是排名值，如果有两个或者多个相同数字，那么取两个位数的平均值

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [126]:
obj.rank(method = 'first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [127]:
obj.rank(ascending = True, method = 'min') #method是说碰到相同数是选用最小，还是最大，或者按照index来排序

0    6.0
1    1.0
2    6.0
3    4.0
4    3.0
5    2.0
6    4.0
dtype: float64

In [128]:
frame = pd.DataFrame({'b':[4.3,7,-3,2],'a':[0,1,0,1],'c':[-2,5,8,-2.5]})
frame.rank(axis= 'columns') #按列的大小来比较，按行来算

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [129]:
obj = pd.Series(range(5), index = ['a','a','b','b','c'])
obj
obj.index.is_unique

False

In [130]:
obj['a']
obj['c']

4

In [131]:
df = pd.DataFrame(np.random.randn(4,3), index = ['a','a','b','b'])
print(df)
df.loc['b']

          0         1         2
a  2.678042 -0.007008 -0.081799
a  0.091234  0.484271 -0.391494
b  0.759332  0.426234  1.052999
b -0.121425 -0.529353 -0.821052

          0         1         2
b  0.759332  0.426234  1.052999
b -0.121425 -0.529353 -0.821052

In [132]:
df = pd.DataFrame([[1.4, np.nan],[7.1, -4.5],[np.nan, np.nan], [0.75, -1.3]], index = ['a','b','c','d'], columns = ['one','two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [133]:
df.sum() #不同行相加

one    9.25
two   -5.80
dtype: float64

In [134]:
df.sum(axis = 'columns')#不同列相加

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [135]:
df.mean(axis = 'columns', skipna = False) #skipna=True 就会忽略na，false就会返回na值，无法相加

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [138]:
df.idxmax() #返回不同列最大值的index索引值
df.idxmin()

one    d
two    b
dtype: object

In [139]:
df.cumsum() #返回的是从上到下不断累加的值

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [140]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [141]:
obj = pd.Series(['a','a','b','c']*4)

In [142]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [5]:
conda install pandas-datareader

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working...
The environment is inconsistent, please check the package plan carefully
The following packages are causing the inconsistency:

  - defaults/win-64::anaconda==custom=py37_1
  - defaults/win-64::astropy==3.2.1=py37he774522_0
  - defaults/win-64::bkcharts==0.2=py37_0
  - defaults/win-64::bokeh==1.2.0=py37_0
  - defaults/win-64::bottleneck==1.2.1=py37h452e1ab_1
  - defaults/noarch::dask==2.1.0=py_0
  - defaults/win-64::h5py==2.9.0=py37h5e291fa_0
  - defaults/win-64::imageio==2.5.0=py37_0
  - defaults/win-64::matplotlib==3.1.0=py37hc8f65d3_0
  - defaults/win-64::mkl-service==2.0.2=py37he774522_0
  - defaults/win-64::mkl_fft==1.0.12=py37h14836fe_0
  - defaults/win-64::mkl_random==1.0.2=py37h343c172_0
  - defaults/win-64::numba==0.44.1=py37hf9181ef_0
  - defaults/win-64::numexpr==2.6.9=py37hdce8814_0
  - defaults/win-64::numpy==1.16.4=py37h19fb1c0_0
  - defaults/win-64::pandas==0.24.2=py37ha925a31_0
  - defaults/win-64::patsy==0.5.1=py37_0
  - conda-forge/win-64::pyspark==2.3.2=py37_1000
  - defaults/win-64::pytables==3.5.2=py37h1da0976_1
  - defaults/win-64::pytest-arraydiff==0.3=py37h39e3cac_0
  - defaults/win-64::pytest-astropy==0.5.0=py37_0
  - defaults/win-64::pytest-doctestplus==0.3.0=py37_0
  - pytorch/win-64::pytorch==1.2.0=py3.7_cuda100_cudnn7_1
  - defaults/win-64::pywavelets==1.0.3=py37h8c2d366_1
  - defaults/win-64::scikit-image==0.15.0=py37ha925a31_0
  - defaults/win-64::scikit-learn==0.21.2=py37h6288b17_0
  - defaults/win-64::scipy==1.2.1=py37h29ff71c_0
  - defaults/win-64::seaborn==0.9.0=py37_0
  - defaults/win-64::statsmodels==0.10.0=py37h8c2d366_0
  - pytorch/win-64::torchvision==0.4.0=py37_cu100
  - defaults/win-64::_anaconda_depends==2019.03=py37_0
done

## Package Plan ##

  environment location: C:\Users\90512\Anaconda3

  added / updated specs:
    - pandas-datareader


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    ca-certificates-2020.1.1   |                0         125 KB
    certifi-2019.11.28         |           py37_0         154 KB
    conda-4.8.2                |           py37_0         2.8 MB
    numpy-1.18.1               |   py37h93ca92e_0           6 KB
    numpy-base-1.18.1          |   py37hc3f5095_1         3.8 MB
    openssl-1.1.1d             |       he774522_4         4.8 MB
    pandas-datareader-0.8.1    |             py_0          71 KB
    vs2015_runtime-14.16.27012 |       hf0eaf9b_1         1.1 MB
    ------------------------------------------------------------
                                           Total:        12.9 MB

The following NEW packages will be INSTALLED:

  numpy-base         pkgs/main/win-64::numpy-base-1.18.1-py37hc3f5095_1
  pandas-datareader  pkgs/main/noarch::pandas-datareader-0.8.1-py_0

The following packages will be UPDATED:

  ca-certificates    conda-forge::ca-certificates-2019.11.~ --> pkgs/main::ca-certificates-2020.1.1-0
  numpy                               1.16.4-py37h19fb1c0_0 --> 1.18.1-py37h93ca92e_0
  openssl            conda-forge::openssl-1.1.1d-hfa6e2cd_0 --> pkgs/main::openssl-1.1.1d-he774522_4
  vs2015_runtime                     14.15.26706-h3a45250_4 --> 14.16.27012-hf0eaf9b_1

The following packages will be SUPERSEDED by a higher-priority channel:

  certifi                                       conda-forge --> pkgs/main
  conda                                         conda-forge --> pkgs/main



Downloading and Extracting Packages

vs2015_runtime-14.16 | 1.1 MB    |            |   0%
vs2015_runtime-14.16 | 1.1 MB    | 1          |   1%
vs2015_runtime-14.16 | 1.1 MB    | ########## | 100%

certifi-2019.11.28   | 154 KB    |            |   0%
certifi-2019.11.28   | 154 KB    | ########## | 100%

numpy-base-1.18.1    | 3.8 MB    |            |   0%
numpy-base-1.18.1    | 3.8 MB    | ##9        |  29%
numpy-base-1.18.1    | 3.8 MB    | ######3    |  64%
numpy-base-1.18.1    | 3.8 MB    | #########9 |  99%
numpy-base-1.18.1    | 3.8 MB    | ########## | 100%

numpy-1.18.1         | 6 KB      |            |   0%
numpy-1.18.1         | 6 KB      | ########## | 100%

pandas-datareader-0. | 71 KB     |            |   0%
pandas-datareader-0. | 71 KB     | ####5      |  45%
pandas-datareader-0. | 71 KB     | ########## | 100%

ca-certificates-2020 | 125 KB    |            |   0%
ca-certificates-2020 | 125 KB    | #2         |  13%
ca-certificates-2020 | 125 KB    | ########## | 100%

openssl-1.1.1d       | 4.8 MB    |            |   0%
openssl-1.1.1d       | 4.8 MB    |            |   0%
openssl-1.1.1d       | 4.8 MB    | ###2       |  32%
openssl-1.1.1d       | 4.8 MB    | ####8      |  48%
openssl-1.1.1d       | 4.8 MB    | #######8   |  78%
openssl-1.1.1d       | 4.8 MB    | #########5 |  96%
openssl-1.1.1d       | 4.8 MB    | ########## | 100%

conda-4.8.2          | 2.8 MB    |            |   0%
conda-4.8.2          | 2.8 MB    |            |   1%
conda-4.8.2          | 2.8 MB    | #####6     |  56%
conda-4.8.2          | 2.8 MB    | #######3   |  73%
conda-4.8.2          | 2.8 MB    | ########## | 100%
Preparing transaction: ...working... done
Verifying transaction: ...working... done
Executing transaction: ...working... done

Note: you may need to restart the kernel to use updated packages.

WARNING conda.gateways.disk.delete:unlink_or_rename_to_trash(140): Could not remove or rename C:\Users\90512\Anaconda3\Lib\site-packages\conda\gateways\connection\adapters\__pycache__\ftp.cpython-37.pyc.c~.  Please remove this file manually (you may need to reboot to free file handles)

In [8]:
import pandas_datareader.data as web
import pandas as pd


all_data = {ticker:web.get_data_yahoo(ticker) for ticker in ['AAPL','IBM','MSFT','GOOG']}
price = pd.DataFrame({ticker:data['Adj Close'] for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume'] for ticker, data in all_data.items()})

In [10]:
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2020-02-26  0.015864 -0.013831  0.012495  0.003407
2020-02-27 -0.065368 -0.047513 -0.070459 -0.053898
2020-02-28 -0.000585 -0.022237  0.024213  0.016114
2020-03-02  0.093101  0.031886  0.066539  0.037168
2020-03-03 -0.019738 -0.026955 -0.033798 -0.024138

In [11]:
returns['MSFT'].corr(returns['IBM']) #计算两个Series重叠的，非NA，按索引值对其的值的相关性

0.48068687131479215

In [12]:
returns['MSFT'].cov(returns['IBM']) #计算两个Series重叠的，非NA，按索引值对其的值的协方差

9.415599602474483e-05

In [13]:
returns.MSFT.corr(returns.IBM)

0.48068687131479215

In [15]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.407661  0.604470  0.550920
IBM   0.407661  1.000000  0.480687  0.420249
MSFT  0.604470  0.480687  1.000000  0.684193
GOOG  0.550920  0.420249  0.684193  1.000000

In [16]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000255  0.000086  0.000143  0.000134
IBM   0.000086  0.000175  0.000094  0.000085
MSFT  0.000143  0.000094  0.000220  0.000155
GOOG  0.000134  0.000085  0.000155  0.000232

In [17]:
returns.corrwith(returns.IBM) #IBM和其他列的相关性，返回的是Series

AAPL    0.407661
IBM     1.000000
MSFT    0.480687
GOOG    0.420249
dtype: float64

In [18]:
returns.corrwith(volume)

AAPL   -0.146496
IBM    -0.091673
MSFT   -0.043018
GOOG   -0.024416
dtype: float64

In [20]:
obj = pd.Series(['c','a','d','a','a','b','b','c','c'])

In [21]:
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [22]:
obj.value_counts() #计算值的个数

c    3
a    3
b    2
d    1
dtype: int64

In [31]:
pd.value_counts(obj.values, sort = False )

b    2
d    1
a    3
c    3
dtype: int64

In [33]:
mask = obj.isin(['b','c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [34]:
obj[mask] # 把False全部过滤掉

0    c
5    b
6    b
7    c
8    c
dtype: object

In [36]:
to_match = pd.Series(['c','a','b','c','a'])

In [37]:
unique_vals = pd.Series(['c','b','a'])

In [39]:
pd.Index(unique_vals).get_indexer(to_match) # 返回第一个Series再第二个Series的索引

array([0, 2, 1, 0, 2], dtype=int64)

In [40]:
data = pd.DataFrame({'Qu1': [1,3,4,3,4], 'Qu2':[2,3,1,2,3],'Qu3': [1,5,2,4,4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [42]:
result = data.apply(pd.value_counts).fillna(0)
result # 返回的是data里的数据在没列出现的次数

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0